# # # # # # # # # # # # 算术运算符：+、-、*、/、//、%、** # # # # # # # # # # # #
# print("10 + 4 = ", 10 + 4)  # 加
# print("10 - 4 = ", 10 - 4)  # 减
# print("10 * 4 = ", 10 * 4)  # 乘
# print("10 / 4 = ", 10 / 4)  # 除 - 2.5
# print("10 // 4 = ", 10 // 4)    # 整除（结果为整数）- 2
# print("10 % 4 = ", 10 % 4)  # 取余 / 求模 - 2
# print("10 ** 4 = ", 10 ** 4)    # 幂指数，10 的 4 次方 - 10000

# 算术运算符的优先级（由高到低）：** -> *、/、//、% -> +、-
# print("0.1 + 10 / 4**2 = ", 0.1 + 10 / 4 ** 2)    # 0.725


# 案例：输入两个数 x 和 y，计算 x + y 以及 x - y 的结果并输出
# float(...) -> 将 其他类型 转为 浮点数类型
# x = float(input("请输入 x 的值："))
# y = float(input("请输入 y 的值："))

# 0.09999999999999998 -> 精度损失：由于计算机底层是基于 二进制 进行数据的存储与处理，二进制是无法准确地表示所有的小数，因此涉及到浮点数的运算，可能会损失精度
# print("x + y = ", x + y)
# print("x - y = ", x - y)


# # # # # # # # # # # # 赋值运算符：=、+=、-=、*=、/=、%=、//=、**= # # # # # # # # # # # #
# num = 85
#
# num += 10   # num = num + 10
# print("num += 10 后，num = ", num)    # 95
#
# num -= 10   # num = num - 10
# print("num -= 10 后，num = ", num)    # 85
#
# num *= 10   # num = num * 10
# print("num *= 10 后，num = ", num)    # 850
#
# num /= 10   # num = num / 10
# print("num /= 10 后，num = ", num)    # 85.0
#
# num //= 10   # num = num // 10
# print("num //= 10 后，num = ", num)    # 8.0
#
# num %= 3   # num = num % 3
# print("num %= 3 后，num = ", num)    # 2.0
#
# num **= 3   # num = num ** 3
# print("num **= 3 后，num = ", num)    # 8.0


# # # # # # # # # # # # 比较运算符：==、!=、>、>=、<、<= # # # # # # # # # # # #
# print("100 == 100 吗：", 100 == 100)  # True
# print("'100' == '100' 吗：", '100' == '100')  # True
# print("100 != 100 吗：", 100 != 100)  # False
#
# print("100 < 100 吗：", 100 < 100)    # False
# print("100 <= 100 吗：", 100 <= 100)  # True
#
# print("100 > 100 吗：", 100 > 100)    # False
# print("100 >= 100 吗：", 100 >= 100)  # True


# # # # # # # # # # # # 逻辑运算符：and、or、not # # # # # # # # # # # #
# 案例 1：键盘输入一个整数，判断这个数字是否在 10 - 20 之间 -> 在：True，不在：False
# n = int(input("请输入一个整数："))
#
# print(f"{n} 在 10 - 20 之间：", n >= 10 and n <= 20)    # and 连接的条件是并且的关系，两个条件同时成立（True），结果才是 True；否则，就是 False
# # print(f"{n} 在 10 - 20 之间：", 10 <= n <= 20)    # and 连接的条件是并且的关系，两个条件同时成立（True），结果才是 True；否则，就是 False


# 案例 2：键盘输入一个整数，判断这个数字是否不在 10 - 20 之间
n = int(input("请输入一个整数："))

print(f"{n} 不在 10 - 20 之间：", n < 10 or n > 20)  # or 连接的条件，是或者的关系，只要其中有一个成立（True），结果就是 True；全部不成立，结果才是 False
