# for 循环：遍历输入的字符串
#
# msg = input("请输入需要遍历的字符串：")
#
# for s in msg:   # s 表示遍历出来的元素；msg 表示需要遍历的数据
#     print(f"元素：{s}")
# else:
#     print("遍历结束！")


# 案例 1：计算 1 - 100 之间所有的奇数之和

# 原始
# total = 0   # 记录累加之和
#
# for i in range(1, 101):
#     if i % 2 == 1:  # 奇数
#         total += i
#
# print("1 - 100 之间的奇数累加之和：", total)

# 简化
# total = 0   # 记录累加之和
#
# for i in range(1, 101, 2):
#     total += i
#
# print("1 - 100 之间的奇数累加之和：", total)


# 案例 2：计算 100 - 500 之间所有 3 的倍数的数字之和
#
# total = 0   # 记录累加之和
#
# for i in range(100, 501):
#     if i % 3 == 0:  # i 是 3 的倍数
#         total += i
#
# print("100 - 500 之间所有 3 的倍数的数字之和：", total)

"""
循环嵌套：根据输入的长方形的长度 m、宽度 n，打印一个长方形
    
    如下是一个长度为 10、宽度为 5 的长方形：
    * * * * * * * * * *
    * * * * * * * * * *
    * * * * * * * * * *
    * * * * * * * * * *

    print("*")：自带换行效果，每一次执行都会输出到新的一行中
    print("*", end="")：end 表示每一次输出以什么结束，默认 \n，表示换行
"""
#
# # 1. 接收键盘录入 m、n
# # 长度
# m = int(input("请输入长方形的长度："))
# # 宽度
# n = int(input("请输入长方形的宽度："))
#
# # 2. 打印长方形
# for j in range(n):  # 控制行
#     for i in range(m):  # 控制列
#         print("*", end=" ")
#     print()


# 嵌套循环案例：打印九九乘法表
for i in range(1, 10):  # 外层循环 - 控制行
    for j in range(1, i + 1):   # 内层循环 - 控制列
        print(f"{j} × {i} = {j * i}", end="\t")
    print()
